Repository: luiz158/Seam_2_2
Catalog: doc/Seam_Reference_Guide/*/Websphere.po
Languages: it_it

source: <literal>import.sql</literal> &#8212; either for the dialect or Derby DB the <literal>ID</literal> column can not be populated by this file and was removed.
it_it: <literal>import.sql</literal> &#8212; la colonna <literal>ID</literal> sia del dialetto sia del Derby DB non può essere popolata ed è stata rimossa.

source: Changes for dependent libraries
it_it: Modifiche per le librerie dipendenti

source: The Websphere version requires several library packages because they are not included as they are with JBoss AS. These are primarily for hibernate and their dependencies. Below are listed only the additional jars needed above and beyond the JBoss <literal>JPA</literal> example.
it_it: La versione di Websphere richiede parecchi pacchetti di libreria inclusi invece in JBoss AS. Questi servono principalmente per Hibernate e le sue dipendenze. Sotto appare la lista dei jar addizionali necessari sopra e a prescindere dall'esempio JBoss <literal>JPA</literal>.

source: To use Hibernate as your JPA provider you need the following jars:
it_it: Per usare Hibernate come provider JPA occorrono i seguenti jar:

source: Various third party jars that Websphere needs:
it_it: Websphere richiede vari jar di Terze Parti:

source: Deploying an application created using <literal>seam-gen</literal> on Websphere V7
it_it: Deploy dell'applicazione creata usando <literal>seam-gen</literal> su Websphere V7

source: <literal>seam-gen</literal> is a very useful tool for developers to quickly get an application up and running, and provides a foundation to add your own functionality. Out of box <literal>seam-gen</literal> will produce applications configured to run on JBoss AS. These instructions will show the steps needed to get it to run on Websphere. As stated above in <xref linkend="jee5-websphere-section"/> there are some tricky changes needed to get an EJB3 application running. This section will take you through the exact steps.
it_it: <literal>seam-gen</literal> è un tool molto utile per gli sviluppatori per ottenere velocemente applicazioni pronte per l'esecuzione e fornisce un fondamento per aggiungere proprie funzionalità. Di base <literal>seam-gen</literal> produrrà applicazioni configurate per girare su JBoss AS. Queste istruzioni mostreranno i passi necessari per farle funzionare su Websphere. Come dichiarato sopra in <xref linkend="jee5-websphere-section"/> ci sono alcune modifiche sottili necessarie per avere un'applicazione EJB3 funzionante. Questa sezione mostrerà gli esatti passi da compiere.

source: Running <literal>seam-gen</literal> Setup
it_it: Eseguire il setup in <literal>seam-gen</literal>

source: The first step is setting up <literal>seam-gen</literal> to construct the base project. There are several choices made below, specifically the datasource and hibernate values that we will adjust once the project is created.
it_it: Il primo passo è impostare <literal>seam-gen</literal> per costruire il progetto base. Ci sono parecchie scelte fatte sotto, in particolar modo il datasource ed i valori Hibernate che occorre aggiustare una volta che il progetto è creato.

source: Type <literal>./seam new-project</literal> to create your project and <literal>cd /home/jbalunas/workspace/websphere_example</literal> to the newly created structure.
it_it: Digitare <literal>./seam new-project</literal> per creare il progetto e <literal>cd /home/jbalunas/workspace/websphere_example</literal> per la nuova struttura creata.

source: Changes needed for deployment to Websphere
it_it: Cambiamenti richiesti per il deploy in Websphere

source: We now need to make some changes to the generated project.
it_it: Ora serve apportare alcuni cambiamenti al progetto generato.

source: Alter the <literal>jta-data-source</literal> to be <literal>DefaultDatasource</literal>. We are going to be using the integrated Websphere DB.
it_it: Modificare <literal>jta-data-source</literal> in <literal>DefaultDatasource</literal>. Verrà usato il DB integrato di Websphere.

source: Add or change the properties below. These are described in detail at <xref linkend="jee5-websphere-section"/>:
it_it: Aggiungere o modificare le proprietà sotto. Queste sono descritte in dettaglio in <xref linkend="jee5-websphere-section"/>:

source: Remove the JBoss AS specific method of exposing the EntityManagerFactory:
it_it: Rimuovere i metodi specifici di JBoss AS per esporre EntityManagerFactory:

source: You'll need to alter <literal>persistence-prod.xml</literal> as well if you want to deploy to Websphere using the prod profile.
it_it: Serve modificare <literal>persistence-prod.xml</literal> anche se si vuole eseguire il deploy in Websphere usando il profile prod.

source: As with other examples we need to include this java class for DB support. It can be copied from the <literal>jpa</literal> example into the <literal>websphere_example/src</literal> directory.
it_it: Come per gli altri esempi occorre includere questa classe java per il supporto DB. Può essere copiata dall'esempio <literal>jpa</literal> nella directory <literal>websphere_example/src</literal>.

source: You can delete this file as we aren't deploying to JBoss AS ( <literal>jboss-app.xml</literal> is used to enable classloading isolation in JBoss AS)
it_it: Si può cancellare questo file poiché non si eseguirà il deploy in JBoss AS (<literal>jboss-app.xml</literal> viene usato per abilitare l'isolamento del classloading in JBoss AS)

source: You can delete these file as we aren't deploying to JBoss AS (these files define datasources in JBoss AS, we are using Websphere's default datasource)
it_it: Si possono cancellare questi file poiché non si eseguirà il deploy in JBoss AS (questi file definiscono i datasource in JBoss AS, si userà invece il datasource di default di Websphere)

source: Enable container managed transaction integration - add the <literal> &lt;transaction:ejb-transaction /&gt; </literal> component, and it's namespace declaration <literal> xmlns:transaction="http://jboss.com/products/seam/transaction" </literal>
it_it: Abilitare l'integrazione delle transazioni gestite dal container - aggiungere il componente <literal>&lt;transaction:ejb-transaction /&gt;</literal> ed la sua dichiarazione di namespace <literal>xmlns:transaction="http://jboss.com/products/seam/transaction"</literal>

source: Alter the <literal>jndi-pattern</literal> to <literal> java:comp/env/websphere_example/#{ejbName} </literal>
it_it: Modificare <literal>jndi-pattern</literal> in <literal>java:comp/env/websphere_example/#{ejbName}</literal>

source: We do not need <literal>managed-persistence-context</literal> for this example and so can delete its entry.
it_it: Non serve <literal>managed-persistence-context</literal> per quest'esempio e quindi si può cancellare questa riga.

source: As with the <literal>jee5/booking</literal> example we need to add EJB references to the web.xml. These references require replacing /local string in <literal>ejb-ref-name</literal> to flag them for Websphere to perform the proper binding.
it_it: Come per l'esempio <literal>jee5/booking</literal> occorre aggiungere i riferimenti EJB a web.xml. Questi riferimenti richiedono di sostituire la stringa /local in <literal>ejb-ref-name</literal> e selezionarli affinché Websphere esegua il corretto binding.

source: Creating the <literal>AuthenticatorAction</literal> EJB
it_it: Creazione dell'EJB <literal>AuthenticatorAction</literal>

source: We want to take the existing <literal>Authenticator</literal> Seam POJO component and create an EJB3 out of it.
it_it: Si vuole prendere il componente POJO Seam <literal>Authenticator</literal> e creare da questo un EJB3.

source: Change the generated Authenticator class
it_it: Cambiare la classe Authenticator generata

source: Rename the class to <literal>AuthenticatorAction</literal>
it_it: Rinominare la classe in <literal>AuthenticatorAction</literal>

source: Add the <literal>@Stateless</literal> annotation to the new <literal>AuthenticatorAction</literal> class.
it_it: Aggiungere l'annotazione <literal>@Stateless</literal> alla nuova classe <literal>AuthenticatorAction</literal>.

source: Create an interface called <literal>Authenticator</literal> which <literal>AuthenticatorAction</literal> implements (EJB3 requires session beans to have a local interface). Annotate the interface with <literal>@Local</literal> , and add a single method with same signature as the <literal>authenticate</literal> in <literal>AuthenticatorAction</literal> .
it_it: Creare un'interfaccia chiamata <literal>Authenticator</literal> ed implementata da <literal>AuthenticatorAction</literal> (EJB3 richiede che i bean di sessione abbiano un'interfaccia locale). Annotare l'interfaccia con <literal>@Local</literal>, ed aggiungere un singolo metodo con la stessa firma come <literal>authenticate</literal> in <literal>AuthenticatorAction</literal>.

source: We've already added its reference to the <literal>web.xml</literal> file so are good to go.
it_it: Abbiamo già aggiunto il suo riferimento al file <literal>web.xml</literal> e quindi si può procedere.

source: Extra jar dependencies and other changes to the <literal>build.xml</literal>
it_it: Dipendenze extra ed altre modifiche a <literal>build.xml</literal>

source: This application has similar requirements as the <literal>jee5/booking</literal> example.
it_it: Quest'applicazione ha requisiti simili come nell'esempio <literal>jee5/booking</literal>.

source: Change the default target to <literal>archive</literal> (we aren't going to cover automatic deployment to Websphere).
it_it: Modificare il target di default a <literal>archive</literal> (non si tratterà il deploy automatico in Websphere).

source: Websphere looks for the drools <literal>/security.drl</literal> file in the root of the <literal>war</literal> file instead of the root of the <literal>websphere_example.jar</literal> so we need to have the <literal>build.xml</literal> move it to the correct location at build time. The following must be added at the top of the <literal> &lt;target name="war" depends="compile" description="Build the distribution .war file"&gt; </literal> target.
it_it: Websphere cerca il file drools <literal>/security.drl</literal> nella radice di file <literal>war</literal> invece che nella radice di <literal>websphere_example.jar</literal> e quindi serve spostare <literal>build.xml</literal> nella corretta posizione al momento del build. La seguente riga deve essere aggiunta in cima al target <literal> &lt;target name="war" depends="compile" description="Build the distribution .war file"&gt; </literal>.

source: Now we need to get extra jars into the <literal>build.xml</literal>. Look for the <literal>&lt;fileset dir="${basedir}"&gt;</literal> section of the task below. Add the new includes at the bottom of the fileset.
it_it: Ora occorre inserire i jar extra in <literal>build.xml</literal>. Cercare la sezione <literal>&lt;fileset dir="${basedir}"&gt;</literal> del task sotto. Aggiungere nuovi include in fondo al fileset.

source: Hibernate dependencies
it_it: Dipendenze Hibernate

source: Third party dependencies.
it_it: Dipendenze di terze parti

source: <literal>jboss-seam.jar</literal> - this is needed in the <literal>ear</literal> base directory.
it_it: <literal>jboss-seam.jar</literal> - questo è richiesto nella directory base <literal>ear</literal>.

source: You should end up with something like:
it_it: Si dovrebbe terminare con qualcosa di simile a:

source: Building and deploying the seam-gen'd application to Websphere
it_it: Build e deploy di un'applicazione seam-gen in Websphere

source: Build your application by calling <literal>ant</literal> in the base directory of your project (ex. <literal>/home/jbalunas/workspace/websphere_example</literal> ). The target of the build will be <literal>dist/websphere_example.ear</literal> .
it_it: Eseguire il build dell'applicazione chiamando <literal>ant</literal> nella directory base del progetto (es. <literal>/home/jbalunas/workspace/websphere_example</literal>). Il target del build sarà <literal>dist/websphere_example.ear</literal>.

source: To deploy the application follow the instructions here : <xref linkend="jee5-websphere-deploy"/> but use references to this project <literal>websphere_example</literal> instead of <literal>jboss-seam-jee5</literal>.
it_it: Per fare il deploy dell'applicazione seguire le istruzioni in <xref linkend="jee5-websphere-deploy"/> ma usare i riferimenti a questo progetto <literal>websphere_example</literal> invece che a <literal>jboss-seam-jee5</literal>.

source: Checkout the app at: <literal>http://localhost:9080/websphere_example/index.html</literal>
it_it: Controllare l'applicazione all'indirizzo: <literal>http://localhost:9080/websphere_example/index.html</literal>
