Repository: luiz158/Seam_2_2
Catalog: doc/Seam_Reference_Guide/*/Websphere.po
Languages: it_it

source: Seam on IBM's Websphere AS
it_it: Seam su Websphere AS di IBM

source: Websphere AS V7 is IBM's application server offering. This release is fully Java EE 5 certified.
it_it: Websphere AS V7 è l'application server di IBM. Questa release è pienamente certificata Java EE 5.

source: First we will go over some basic information about the Websphere AS environment that we used for these examples. We will go over the details of those steps with the JEE5 booking example. We will also deploy the JPA example application.
it_it: Innanzitutto procediamo con alcune informazioni base sull'ambiente Websphere AS che useremo negli esempi. Andremo a fondo nei dettagli con l'esempio JEE5 Prenotazione. Procederemo anche nel deploy di un'applicazione d'esempio JPA.

source: Websphere AS environment and deployment information
it_it: Informazioni sull'ambiente ed il deploy in Websphere AS

source: Websphere AS is a commercial product and so we will not discuss the details of its installation other than to say follow the directions provided by your particular installation type and license. This section will detail the exact server versions used, installation tips, and some custom properties that are needed for all of the examples.
it_it: Websphere AS è un prodotto commerciale e quindi non si discuteranno i dettagli della sua installazione, basta dire di seguire le istruzioni fornite dal particolare tipo di installazione e dalla licenza. Questa sezione dettaglierà le versioni del server, i suggerimenti sull'installazione ed alcune proprietà specifiche necessarie negli esempi.

source: Installation versions
it_it: Versioni delle installazioni

source: All of the examples and information in this chapter are based on the version V7 of Websphere AS at the time of this writing.
it_it: Tutti gli esempi e le informazioni in questo capitolo sono basate sulla versione V7 di Websphere AS al momento della scrittura.

source: After installing Websphere AS, create server profile with Profile Management Tool, if you didn't create profile in installation process.
it_it: Dopo l'installazione di Websphere AS, creare il profile del server con il Profile Management Tool, qualora non si sia creato il profile in fase di installazione.

source: The <literal>jee5/booking</literal> example
it_it: L'esempio <literal>jee5/booking</literal>

source: The <literal>jee5/booking</literal> example is based on the Hotel Booking example (which runs on JBoss AS). Out of the box it is designed to run on Glassfish, but with the steps below it can be deployed to Websphere. It is located in the <literal>$SEAM_DIST/examples/jee5/booking</literal> directory.
it_it: L'esempio <literal>jee5/booking</literal> è basato sull'esempio PrenotazioneHotel (che gira su JBoss AS). E' stato progettato per girare anche su Glassfish, ma con i passi descritti sotto può essere deployato in Websphere. E' collocato nella directory <literal>$SEAM_DIST/examples/jee5/booking</literal>.

source: <title>Configuration file changes</title>
it_it: <title>Cambiamenti al file di configurazione</title>

source: Below are the configuration file changes that are need to the base example.
it_it: Sotto sono riportate le modifiche al file di configurazione necessarie all'esempio base.

source: We need to change the way that we look up EJBs for WAS. We need to remove the <literal>/local</literal> from the end of the <literal>jndi-pattern</literal> attribute. It should look like this:
it_it: Occorre cambiare il modo di ricerca EJB per WAS. Bisogna rimuovere <literal>/local</literal> dalla fine dell'attributo <literal>jndi-pattern</literal>. Dovrebbe apparire così:

source: We need to replace the /local string from <literal>ejb-ref-name</literal>. See at the following final code:
it_it: Sostituire la stringa /local da <literal>ejb-ref-name</literal>. Vedere il seguente codice finale:

source: We have to make some changes to the EJB references in the <literal>web.xml</literal>. These changes are what will allow WAS to bind automatically the EJB3 references in the web module to the the actual EJB3 beans in the EAR module. Replace all of the /local strings in <literal>ejb-local-refs</literal> when the values below.
it_it: Occorre apportare alcumi cambiamenti ai riferimenti EJB in <literal>web.xml</literal>. Queste modifiche consentono a WAS di associare automaticamente i riferimenti EJB3 nel modulo web ai bean EJB3 nel modulo EAR. Sostituire tutte le stringhe /local in <literal>ejb-local-refs</literal>.

source: Note also that <literal>EjbSynchronizations</literal> is a built-in Seam EJB and not part of the Hotel Booking example. This means that if your application's <literal>components.xml</literal> specifies <literal>transaction:ejb-transaction</literal>, then you must include:
it_it: Si noti che <literal>EjbSynchronizations</literal> è un EJB predefinito in Seam e non è parte dell'esempio Prenotazione Hotel. Questo significa che se <literal>components.xml</literal> specifica <literal>transaction:ejb-transaction</literal>, allora occorre includere:

source: in your web.xml. If you don't include it, you'll get the following error:
it_it: in web.xml. Se non viene incluso, si ottiene il seguente errore:

source: For this example we will be using the default datasource that comes with WAS. To do this change the <literal>jta-data-source</literal> element:
it_it: Per questo esempio useremo il datasource di default che è presente in WAS. Cambiare l'elemento <literal>jta-data-source</literal>:

source: Then we need to adjust some of the hibernate properties. First comment out the Glassfish properties. Next you need to add/change the properties:
it_it: Poi occorre sistemare alcune proprietà Hibernate. Innanzitutto commentare le proprietà Glassfish. Poi occorre aggiungere/modificare le proprietà:

source: <literal>hibernate.transaction.manager_lookup_class</literal> &#8212; Standard Hibernate transaction manager property for WAS 6.X and 7
it_it: <literal>hibernate.transaction.manager_lookup_class</literal> &#8212; proprietà del gestore di transazioni standard Hibernate per WAS 6.X e 7

source: <literal>hibernate.transaction.flush_before_completion</literal> &#8212; This is commented out because we want the container to manage the transactions. Also if this is set to <literal>true</literal> an exception will be thrown by WAS when the EJBContext is looked up.
it_it: <literal>hibernate.transaction.flush_before_completion</literal> &#8212; questo è commentato poiché si vuole che il container gestisce le transazioni. Inoltre se questo viene impostato a <literal>true</literal>, viene lanciata un'eccezione da WAS quando viene cercato l'EJBContext.

source: <literal>hibernate.dialect</literal> &#8212; From WAS 6.1.0.9 on the embedded DB was switched to the same Derby DB as is in Glassfish v2.
it_it: <literal>hibernate.dialect</literal> &#8212; a partire da WAS 6.1.0.9 l'embedded DB è stato cambiato al Derby DB come in Glassfish v2.

source: You will need to get the <literal>GlassfishDerbyDialect.java</literal> and copy it into the <literal>/src</literal> directory. The java class exists in the JPA example source directory and can be copied using the command below assuming you are in <literal>jee5/booking</literal> directory:
it_it: Occorre prendere <literal>GlassfishDerbyDialect.java</literal> e copiarlo nella directory <literal>/src</literal>. La classe java è presente nella directory dei sorgenti dell'esempio JPA e può essere copiata usando il comando sottostante assumendo di essere nella directory <literal>jee5/booking</literal>:

source: This class will be put into the <literal>jboss-seam-jee5.jar</literal> file.
it_it: Questa classe verrà messa nel file <literal>jboss-seam-jee5.jar</literal>.

source: This file must also be copied from the JPA example because either the Derby DB or the dialect does not support changes to the <literal>ID</literal> column. The files are identical except for the column difference. Use the following command to make the copy
it_it: Questo file deve essere copiato dall'esempio JPA poiché sia Derby DB od il dialetto non supportano non supportano modifiche alla colonna <literal>ID</literal>. I file sono identici tranne per questa colonna. Usare il seguente comando per eseguire la copia:

source: Building the <literal>jee5/booking</literal> example
it_it: Build dell'esempio <literal>jee5/booking</literal>

source: In order to get the changes we have made into our application we need to make some changes to the <literal>build.xml</literal>. There are also some additional jars that are required by our application in order to work with WAS. This section will cover what changes are needed to the <literal>build.xml</literal>.
it_it: Per ottenere le modifiche applicate occorre apportare dei cambiamenti a <literal>build.xml</literal>. Ci sono dei jar aggiuntivi richiesti dall'applicazione per funzionare con WAS. Questa sezione coprirà i cambiamenti da fare a <literal>build.xml</literal>.

source: Library dependency changes
it_it: Modifiche alle dipendenze di libreria

source: We remove the <literal>log4j.jar</literal> so that all of the log output from our application will be added to the WAS log. Additional steps are required to fully configure log4j and those are outside of the scope of this document.
it_it: SI rimuova <literal>log4j.jar</literal> affinché tutto l'output di log dell'applicazione venga aggiunto al log di WAS. Sono richiesti ulteriori passi per configurare log4j ma questi esulano dagli scopi di questo documento.

source: Updating the <literal>build.xml</literal> file
it_it: Aggiornamento del file <literal>build.xml</literal>

source: Add the following entry to the bottom of the <literal>build.xml</literal> file. This overrides the default fileset that is used to populate the <literal>jboss-seam-jee5.jar</literal>. :
it_it: Aggiungere la seguente riga alla fine del file <literal>build.xml</literal>. Questa sovrascrivere il fileset di default che viene usato per popolare <literal>jboss-seam-jee5.jar</literal>:

source: Now all that is left is to execute the <literal>ant archive</literal> task and the built application will be in the <literal>jee5/booking/dist</literal> directory.
it_it: Ora ciò che manca è eseguire il task <literal>ant archive</literal> ed il built dell'applicazione verrà messo nella directory <literal>jee5/booking/dist</literal>.

source: Deploying the application to Websphere
it_it: Deploy dell'applicazione in Websphere

source: So now we have everything we need in place. All that is left is to deploy it - just a few steps more.
it_it: Ora ogni cosa è al posto giusto. Ciò che manca è il deploy - qualche passo in più.

source: For this we will use Websphere's administration console. As before there are some tricks and tips that must be followed.
it_it: Per questo si userà la console di amministrazione di Websphere. Come prima ecco alcuni trucchi e suggerimenti da seguire.

source: The steps below are for the WAS version stated above. The ports are default values, if you changed them substitute your values.
it_it: I passi sottostanti riguardano la versione WAS dichiarata all'inizio. Le porte sono ai valori di default, se vengono cambiati occorre sostituire i valori.

source: Log in to the administration console <programlisting><![CDATA[https://localhost:9043/admin]]></programlisting> or
it_it: Fare il login nella console di amministrazione <programlisting><![CDATA[https://localhost:9043/admin]]></programlisting> oppure

source: Access the <literal>Websphere enterprise applications</literal> menu option under the <literal>Applications --> Application Type</literal> left side menu.
it_it: Accedere all'opzione menu <literal>Websphere enterprise applications</literal> sotto il menu a sinistra <literal>Applications --> Application Type</literal>.

source: At the top of the <literal>Enterprise Applications</literal> table select <literal>Install</literal>. Below are installation wizard pages and what needs to done on each:
it_it: In cima alla tabella <literal>Enterprise Applications</literal> selezionare <literal>Install</literal>. Sotto sono visualizzate le pagine del wizard con ciò che va fatto su ciascuna:

source: Preparing for the application installation
it_it: Preparazione per l'installazione dell'applicazione

source: Browse to the <literal>examples/jee5/booking/dist/jboss-seam-jee5.ear</literal> file using the file upload widget.
it_it: Andare fino al file <literal>examples/jee5/booking/dist/jboss-seam-jee5.ear</literal> usando il widget di upload dei file.

source: Select the <literal>Next</literal> button.
it_it: Selezionare il pulsante <literal>Next</literal>.

source: Select the <literal>Fast Path</literal> button.
it_it: Selezionare il pulsante <literal>Fast Path</literal>.

source: Select installation options
it_it: Selezionare le opzioni di installazione

source: Select the <literal>Deploy enterprise beans</literal> and <literal>Allow EJB reference targets to resolve automatically</literal> check boxes. This is needed unless you used a Websphere AS tool to package the application.
it_it: Selezionare i check box <literal>Deploy enterprise beans</literal> e <literal>Allow EJB reference targets to resolve automatically</literal>. Queso serve amenoché si usi il tool di Websphere AS per impacchettare l'applicazione.

source: Map modules to servers
it_it: Mappare i moduli sul server

source: No changes needed here as we only have one server. Select the <literal>Next</literal> button.
it_it: Avendo un solo server non sono necessarie modifiche. Selezionare il pulsante <literal>Next</literal>.

source: Summary
it_it: Sommario

source: No changes needed here. Select the <literal>Finish</literal> button.
it_it: Non sono necessarie modifiche. Selezionare il pulsante <literal>Finish</literal>.

source: Installation
it_it: Installazione

source: Now you will see it installing and deploying your application.
it_it: Ora si vedra l'installazione ed il deploy dell'applicazione.

source: When it finishes select the <literal>Save</literal> link and you will be returned to the <literal>Enterprise Applications</literal> table.
it_it: Quando termina selezionare il link <literal>Save</literal> e si verrà reindirizzati alla tabella <literal>Enterprise Applications</literal>.

source: Now that we have our application installed we need to make some adjustments to it before we can start it:
it_it: Ora che si è installata l'applicazione occorre fare degli aggiustamenti ad essa prima di avviarla:

source: Starting from the <literal>Enterprise Applications</literal> table select the <literal>Seam Booking</literal> link.
it_it: Partendo dalla tabella <literal>Enterprise Applications</literal> selezionare il link <literal>Seam Booking</literal>.

source: Select the <literal>Manage Modules</literal> link.
it_it: Selezionare il link <literal>Manage Modules</literal>.

source: Select the <literal>jboss-seam-jee5-booking.war</literal> link.
it_it: Selezionare il link <literal>jboss-seam-jee5-booking.war</literal>.

source: Change the <literal>Class loader order</literal> combo box to <literal>Classes loaded with application class loader first (parent last)</literal>.
it_it: Cambiare il combo box <literal>Class loader order</literal> in <literal>Classes loaded with application class loader first (parent last)</literal>.

source: Select <literal>Apply</literal> and then <literal>Save</literal> options.
it_it: Selezionare <literal>Apply</literal> poi l'opzione <literal>Save</literal>.

source: Return to the <literal>Seam Booking</literal> page.
it_it: Ritornare alla pagina <literal>Seam Booking</literal>.

source: On this page select the <literal>Class loading and update detection</literal> link.
it_it: Su questa pagina selezionare il link <literal>Class loading and update detection</literal>.

source: Select the radio button for <literal>Classes loaded with application class loader first</literal>.
it_it: Selezionare il pulsante radio <literal>Classes loaded with application class loader first</literal>.

source: To start the application return to the <literal>Enterprise Applications</literal> table and select our application in the list. Then choose the <literal>Start</literal> button at the top of the table.
it_it: Per avviare l'applicazione ritornare alla tabella <literal>Enterprise Applications</literal> e selezionare l'applicazione nella lista. Quindi scegliere il pulsante <literal>Start</literal> in cima alla tabella.

source: You can now access the application at <literal>http://localhost:9080/seam-jee5-booking/index.html</literal> .
it_it: Ora si può accedere all'applicazione all'indirizzo <literal>http://localhost:9080/seam-jee5-booking/index.html</literal>.

source: The <literal>jpa</literal> booking example
it_it: Esempio Prenotazione <literal>jpa</literal>

source: Thankfully getting the <literal>jpa</literal> example to work is much easier than the <literal>jee5</literal> example. This is the Hotel Booking example implemented in Seam POJOs and using Hibernate JPA with JPA transactions. It does not use EJB3.
it_it: Fortunatamente far funzionare l'esempio <literal>jpa</literal> è molto più semplice che per l'esempio <literal>jee5</literal>. Questo è l'esempio Prenotazione Hotel implementato in Seam POJOs usando Hibernate JPA con le transazioni JPA. Non usa EJB3.

source: The example already has a breakout of configurations and build scripts for many of the common containers including Websphere.
it_it: L'esempio ha già un pò di configurazioni e build script per molti comuni container incluso Websphere.

source: First thing we are going to do is build and deploy that example. Then we'll go over some key changes that we needed.
it_it: La prima cosa da fare è costruire e deployare quell'esempio. Poi verranno apportate delle modifiche chiave necessarie.

source: Building the <literal>jpa</literal> example
it_it: Build dell'esempio <literal>jpa</literal>

source: Building it only requires running the correct ant command: <programlisting>ant websphere7</programlisting> This will create container specific distribution and exploded archive directories with the <literal>websphere7</literal> label.
it_it: Il building richiede l'esecuzione del corretto comando ant: <programlisting>ant websphere7</programlisting>. Questo creerà una distribuzione specifica per il container e le directory esplose per l'archivio con etichetta <literal>websphere7</literal>.

source: Deploying the <literal>jpa</literal> example
it_it: Deploy dell'esempio <literal>jpa</literal>

source: This is similar to the <literal>jee5</literal> example at <xref linkend="jee5-websphere-deploy"/>, but without so many steps.
it_it: Questo è simile all'esempio <literal>jee5</literal> all'indirizzo <xref linkend="jee5-websphere-deploy"/>, ma senza molti passi.

source: From the <literal>Enterprise Applications</literal> table select the <literal>Install</literal> button.
it_it: Dalla tabella <literal>Enterprise Applications</literal> selezionare il pulsante <literal>Install</literal>.

source: Browse to the <literal>examples/jpa/dist-websphere7/jboss-seam-jpa.war</literal> file using the file upload widget.
it_it: Navigare fino al file <literal>examples/jpa/dist-websphere7/jboss-seam-jpa.war</literal> usando il widget per l'upload dei file.

source: Select the <literal>Next</literal> button for the next three pages, no changes are needed.
it_it: Selezionare il pulsante <literal>Next</literal> per le prossime tre pagine, non servono modifiche.

source: Map context roots for Web modules
it_it: Mappare context roots per i moduli Web

source: In the <literal>Context root</literal> text box enter <literal>jboss-seam-jpa</literal>.
it_it: Nel text box <literal>Context root</literal> inserire <literal>jboss-seam-jpa</literal>.

source: <literal>Summary</literal> page
it_it: Pagina <literal>Summario</literal>

source: Review the settings if you wish and select the <literal>Finish</literal> button to install the application. When installation finished select the <literal> Save</literal> link and you will be returned to the <literal>Enterprise Applications</literal> table.
it_it: Rivedere le impostazioni e selezionare il pulsante <literal>Finish</literal> per installre l'applicazione. Quando l'installazione è terminata selezionare il link <literal> Save</literal> e si ritornerà alla tabella <literal>Enterprise Applications</literal>.

source: As with the <literal>jee5</literal> example there are some class loader changes needed before we start the application. Follow the instructions at <xref linkend="websphere-app-adj-after-install"/> but exchange <literal>jboss-seam-jpa_war</literal> for <literal>Seam Booking</literal>.
it_it: Come per l'esempio <literal>jee5</literal> ci sono alcuni cambiamenti necessari al class loader prima di avviare l'applicazione. Seguire le istruzioni in <xref linkend="websphere-app-adj-after-install"/> e cambiare <literal>jboss-seam-jpa_war</literal> per <literal>Seam Booking</literal>.

source: Finally start the application by selecting it in the <literal>Enterprise Applications</literal> table and clicking the <literal>Start</literal> button.
it_it: Infine avviare l'applicazione selezionandola nella tabella <literal>Enterprise Applications</literal> e cliccando il pulsante <literal>Start</literal>.

source: You can now access the application at the <literal>http://localhost:9080/jboss-seam-jpa/index.html</literal>.
it_it: Si può ora accedere all'applicazione all'indirizzo <literal>http://localhost:9080/jboss-seam-jpa/index.html</literal>.

source: What's different for Websphere AS V7
it_it: Cosa c'è di diverso in Websphere AS V7

source: The differences between the JPA examples that deploys to JBoss 4.2 and Websphere AS V7 are mostly expected; library and configuration file changes.
it_it: Le differenze tra gli esempi JPA che eseguono il deploy in JBoss 4.2 e Websphere AS V7 sono perlopiù attese; cambiamenti alle librerie ed al file di configurazione.

source: <para>Configuration file changes</para>
it_it: <para>Cambiamenti al file di configurazione</para>

source: <literal>META-INF/persistence.xml</literal> &#8212; the main changes here are for the datasource JNDI path, switching to the Websphere transaction manager look up class, and changing the hibernate dialect to be <literal>GlassfishDerbyDialect</literal> .
it_it: <literal>META-INF/persistence.xml</literal> &#8212; le maggiori modifiche sono per il path JNDI del datasource, passando alla classe di ricerca del gestore di transazioni Websphere e cambiando il dialetto Hibernate a <literal>GlassfishDerbyDialect</literal>.

source: <literal>WEB-INF/components.xml</literal> &#8212; the change here is <literal>jndi-pattern</literal> without /local string.
it_it: <literal>WEB-INF/components.xml</literal> &#8212; qua la modifica è <literal>jndi-pattern</literal> senza la stringa /local.

source: <literal>META-INF/ejb-jar.xml</literal> &#8212; the same change in <literal>ejb-ref-name</literal>, where is replace /local string in <literal>jboss-seam-jee5/AuthenticatorAction</literal>.
it_it: <literal>META-INF/ejb-jar.xml</literal> &#8212; stessa modifica in <literal>ejb-ref-name</literal>, dove la stringa /local diventa <literal>jboss-seam-jee5/AuthenticatorAction</literal>.

source: <literal>src/GlassfishDerbyDialect.java </literal> &#8212; this class is needed for the hibernate dialect change to <literal>GlassfishDerbyDialect</literal>
it_it: <literal>src/GlassfishDerbyDialect.java </literal> &#8212; questa classe serve per la modifica del dialetto Hibernate a <literal>GlassfishDerbyDialect</literal>
